<a href="https://colab.research.google.com/github/jihyunjeongme/datascience-example-python/blob/master/1%EC%9E%A5_%ED%8C%90%EB%8B%A4%EC%8A%A4_%EA%B8%B0%EC%B4%88%EC%9D%B5%ED%9E%88%EA%B8%B0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import pandas as pd
import numpy as np

In [6]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [7]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=['A','B','C','D'])

df

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283
2013-01-06  0.589594  1.658637  0.712922 -1.008004

In [9]:
df.head(3)

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 0.62323964, -0.82314994,  0.11472143,  0.13818725],
       [ 0.39676834,  0.9546849 , -0.55459045,  0.13094933],
       [-0.45838208, -1.07363187,  0.14250756,  0.84575381],
       [ 1.41170631, -0.25725868,  0.23611514, -0.83455316],
       [-1.65714016, -0.95577391,  0.52672474, -0.32728319],
       [ 0.58959394,  1.65863698,  0.71292151, -1.00800354]])

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.150964 -0.082749  0.196400 -0.175825
std    1.068258  1.134140  0.436130  0.690756
min   -1.657140 -1.073632 -0.554590 -1.008004
25%   -0.244594 -0.922618  0.121668 -0.707736
50%    0.493181 -0.540204  0.189311 -0.098167
75%    0.614828  0.651699  0.454072  0.136378
max    1.411706  1.658637  0.712922  0.845754

In [15]:
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-06  0.589594  1.658637  0.712922 -1.008004
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283
2013-01-03 -0.458382 -1.073632  0.142508  0.845754

In [16]:
df

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283
2013-01-06  0.589594  1.658637  0.712922 -1.008004

In [17]:
df['A']

2013-01-01    0.623240
2013-01-02    0.396768
2013-01-03   -0.458382
2013-01-04    1.411706
2013-01-05   -1.657140
2013-01-06    0.589594
Freq: D, Name: A, dtype: float64

In [18]:
df[0:3]

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754

In [19]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754
2013-01-04  1.411706 -0.257259  0.236115 -0.834553

In [20]:
df.loc[dates[0]]

# 슬라이싱, 2013-01-01 날짜의 위치 값

A    0.623240
B   -0.823150
C    0.114721
D    0.138187
Name: 2013-01-01 00:00:00, dtype: float64

In [21]:
df.loc[:,['A','B']]

# A,B의 모든행을 보고 싶다면

                   A         B
2013-01-01  0.623240 -0.823150
2013-01-02  0.396768  0.954685
2013-01-03 -0.458382 -1.073632
2013-01-04  1.411706 -0.257259
2013-01-05 -1.657140 -0.955774
2013-01-06  0.589594  1.658637

In [22]:
df.loc['20130102':'20130104',['A','B']]

# 2013년 1월 2일 ~ 2013년 1월 4일까의 데이터중 A, B 컬럼의 데이터만 선택

                   A         B
2013-01-02  0.396768  0.954685
2013-01-03 -0.458382 -1.073632
2013-01-04  1.411706 -0.257259

In [23]:
df.loc['20130102',['A','B']]

# 2013년 1월 2일의 A,B 컬럼의 내용 확인

A    0.396768
B    0.954685
Name: 2013-01-02 00:00:00, dtype: float64

In [24]:
df.loc[dates[0],'A']

# dates[0]에 맞는 날짜인 2013년 1월 1일에 A컬럼의 데이터만 확인

0.6232396374255272

In [25]:
df.iloc[3]

# 4번째 행 (0번 부터 시작함)

A    1.411706
B   -0.257259
C    0.236115
D   -0.834553
Name: 2013-01-04 00:00:00, dtype: float64

In [26]:
df.iloc[3:5,0:2]

# 3번째 ~ 5번째 앞, 즉 3번째 ~ 4번째까지 행과 0번 ~ 1번까지 열의 데이터

                   A         B
2013-01-04  1.411706 -0.257259
2013-01-05 -1.657140 -0.955774

In [27]:
df.iloc[[1,2,4],[0,2]]

# 범위가 아니라 콤마(,)로 행이나 열을 지정해서 데이터를 가져올 수 있음

                   A         C
2013-01-02  0.396768 -0.554590
2013-01-03 -0.458382  0.142508
2013-01-05 -1.657140  0.526725

In [28]:
df.iloc[1:3,:]

# 행이나 열에 대한 한쪽은 전체를 의미하게 하고 싶을 때는 콜론 (:)만 사용하면 됩니다.
# 이렇게 행은 범위를 주고, 열은 콜론으로 전체 의미

                   A         B         C         D
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754

In [29]:
df.iloc[:,1:3]

# 행은 전체로 선택

                   B         C
2013-01-01 -0.823150  0.114721
2013-01-02  0.954685 -0.554590
2013-01-03 -1.073632  0.142508
2013-01-04 -0.257259  0.236115
2013-01-05 -0.955774  0.526725
2013-01-06  1.658637  0.712922

In [30]:
df

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283
2013-01-06  0.589594  1.658637  0.712922 -1.008004

In [31]:
df[df.A > 0]

# 특정 조건을 만족하는 데이터를 얻을 수 있습니다.
# 컬럼 A에서 0보다 큰 행만 얻는 값

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-06  0.589594  1.658637  0.712922 -1.008004

In [32]:
df[df > 0]

# 전체 Dataframe에서 0 보다 큰 행을 얻는 값
# 조건을 만족하지 않는 곳은 NaN 처리 됨

                   A         B         C         D
2013-01-01  0.623240       NaN  0.114721  0.138187
2013-01-02  0.396768  0.954685       NaN  0.130949
2013-01-03       NaN       NaN  0.142508  0.845754
2013-01-04  1.411706       NaN  0.236115       NaN
2013-01-05       NaN       NaN  0.526725       NaN
2013-01-06  0.589594  1.658637  0.712922       NaN

In [0]:
df2 = df.copy()

# DataFrame을 복사할 때는 그냥 = 기호를 이용해서 복사하면 실제 데이터의 내용이 복사되는것이 아닌
# 위치만 복사되기 때문에 원본 데이터는 하나만 있게 됩니다.
# 데이터의 내용까지 복사하라는 명령은 copy() 옵션을 붙여 넣으면 됩니다.

In [34]:
df2['E'] = ['one','one','two','three','four','three']
df2

# 새로운 컬럼을 추가할때는 위와 같이 하면 됩니다.

                   A         B         C         D      E
2013-01-01  0.623240 -0.823150  0.114721  0.138187    one
2013-01-02  0.396768  0.954685 -0.554590  0.130949    one
2013-01-03 -0.458382 -1.073632  0.142508  0.845754    two
2013-01-04  1.411706 -0.257259  0.236115 -0.834553  three
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283   four
2013-01-06  0.589594  1.658637  0.712922 -1.008004  three

In [35]:
df2['E'].isin(['two','four'])

# E컬럼에서 two, four가 있는지 조건을 걸고 싶을 때 inin 명령 사용

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [36]:
df2[df2['E'].isin(['two','four'])]

# 결과는 True/False로 반환되는데, 이것을 이용하면 조건에 맞는 데이터를 선택할 수 있음

                   A         B         C         D     E
2013-01-03 -0.458382 -1.073632  0.142508  0.845754   two
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283  four

In [37]:
df

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  0.396768  0.954685 -0.554590  0.130949
2013-01-03 -0.458382 -1.073632  0.142508  0.845754
2013-01-04  1.411706 -0.257259  0.236115 -0.834553
2013-01-05 -1.657140 -0.955774  0.526725 -0.327283
2013-01-06  0.589594  1.658637  0.712922 -1.008004

In [38]:
df.apply(np.cumsum)

# 누적합을 알고 싶을때 numpy의 cumsum을 사용

                   A         B         C         D
2013-01-01  0.623240 -0.823150  0.114721  0.138187
2013-01-02  1.020008  0.131535 -0.439869  0.269137
2013-01-03  0.561626 -0.942097 -0.297361  1.114890
2013-01-04  1.973332 -1.199356 -0.061246  0.280337
2013-01-05  0.316192 -2.155129  0.465478 -0.046946
2013-01-06  0.905786 -0.496493  1.178400 -1.054949

In [40]:
df.apply(lambda x: x.max() - x.min())

# 최대값과 최소값의 차이(혹은 거리)확인

A    3.068846
B    2.732269
C    1.267512
D    1.853757
dtype: float64